Ticketee/app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects`
---
    def index
        @projects = Project.all

INSERT INTO `projects` (`created_at`, `name`, `updated_at`) VALUES ('2010-11-25 06:39:34', 'TextMate 2', '2010-11-25 06:39:34')
---
    def create
        @project = Project.new(params[:project])
        if @project.save

UPDATE `projects` SET `name` = 'TextMate 2 beta', `updated_at` = '2010-11-28 20:56:41' WHERE (`projects`.`id` = 8)
---
    def update
        if @project.update_attributes(params[:project])

DELETE FROM `projects` WHERE (`projects`.`id` = 8)
---
    def destroy
        @project.destroy

SELECT `projects`.* FROM `projects` WHERE (`projects`.`id` = 8) LIMIT 1
---
    def find_project
        @project = Project.find(params[:id])