Ticketee/app/controllers/tickets_controller.rb

    def create
        @ticket = @project.tickets.build(params[:ticket])
        if @ticket.save
---
INSERT INTO `tickets` (`created_at`, `description`, `project_id`, `title`, `updated_at`) VALUES ('2010-11-29 18:41:37', 'My pages are ugly!', 5, 'Non-standards compliance', '2010-11-29 18:41:37')

    def update
        if @ticket.update_attributes(params[:ticket])
---
UPDATE `tickets` SET `title` = 'Make it really shiny!', `updated_at` = '2010-11-29 22:55:21' WHERE (`tickets`.`id` = 7)

    def destroy
        @ticket.destroy
---
DELETE FROM `tickets` WHERE (`tickets`.`id` = 8)

    def find_project
        @project = Project.find(params[:project_id])
---
SELECT `projects`.* FROM `projects` WHERE (`projects`.`id` = 15) LIMIT 1

    def find_ticket
        @ticket = @project.tickets.find(params[:id])
---
SELECT `tickets`.* FROM `tickets` WHERE (`tickets`.project_id = 15) AND (`tickets`.`id` = 8) LIMIT 1